{
    "id": "first_aventure",
    "name": "first_aventure",
    "description": "first_aventure",
    "pages": {
        "0": {
            "level": 0,
            "title": "Bienvenue au Château des Robots",
            "text": [
                "Bonjour jeune explorateur, j'espère que tu n'est pas ici par hasard, mais que tu souhaites te préparer pour rejoindre un équipage et partir à la découverte du Monde Numérique.",
                "Il y a évidement plusieurs manières de découvrir le Monde Numérique, et l'académie du Château des Robots n'est évidemment pas la seule...",
                "Mais elle a fait ses preuves et est déjà reconnue par de nombreux explorateus...",
                "",
                "Pour entrer au Château des Robots, tu vas devoir faire preuve de concentration et de perspicacité.",
                "Je suis là poiur t'aider, mais ça sera à toi de mener ta propre aventure d'apprentissage avant de rejoindre la Vraie Aventure",
                "Car le meilleur moyen pour être recruté par un équipage est de montrer tes compétences à l'entrainement.",
                "Alors c'est parti.",
                "",
                "Commence par répondre à la question suivante afin d'évaluer ton niveau de développement Web.",
                "Sois honnête avec toi-même, une sur-évaluation te mettra en difficulté, une sous-évaluation risque de t'ennuyer, mais c'est peut-être moins grave..."
            ],
            "choices": [
                {
                    "text": "Je n'ai jamais créé de page Web",
                    "description": "Rejoins TimBL pour découvrir l'histoire du Web et la création de page Web",
                    "page": 1
                },
                {
                    "text": "J'ai déjà rencontré le HTML, mais je confonds encore JavaScript et Java",
                    "page": 2,
                    "description": "Alors que les premières pages Web sont apparus de nouveaux besoins se sont fait sentir : les mettre en forme et leur ajouter des interactions avec JavaScript"
                },
                {
                    "text": "Je maîtrise JavaScript mais pas vraiment NodeJS et souhaite découvrir des framaworks",
                    "page": 3,
                    "description": "J'y vais dans l'espace"
                },
                {
                    "text": "J'ai déjà pratiqué plusieurs framework JScomme React ou VueJs'",
                    "page": 4,
                    "description": "J'y vais dans l'espace"
                }
            ]
        }
    }
}